"""
物品ID到名称的统一映射
所有模块共用此映射表
"""

ITEM_NAMES = {
    1: "金币",
    2: "钻石",
    10: "陨铁",
    11: "宠物蛋",
    24: "装备强化石",
    25: "装备图纸",
    26: "宠物粮",
    28: "金铁蹄",
    29: "宝石",
    41: "骸骨之书",
    42: "骑士之书",
    43: "游侠之书",
    44: "幽灵之书",
    45: "古龙之书",
    59: "武装令牌",
    60: "银钥匙",
    61: "金钥匙",
    62: "S钥匙",
    68: "古代碎片（换藏品）",
    71: "铜宝箱1pt",
    72: "银宝箱10pt",
    73: "金宝箱20pt",
    74: "宠物宝箱50pt",
    75: "紫晶宝箱0pt",
    77: "武装晶石",
    132: "家园币",
    135: "功勋币",
    5018: "传承书随机箱",
    5028: "钥匙自选箱",
    5604: "武装宝箱",
    5605: "船长的家具宝箱（粉）",
    
    6014: "宝石箱",
    6105: "武器至宝自选箱碎片",
    6106: "装备至宝自选箱碎片",
    6110: "限定藏品自选箱碎片",
    7000001: "guild coin",
    1386015: "秘宝碎片：仁王"
}
